# ধরে নাও, আমাদের শব্দটা হলো "madam"। আমরা দুটি পয়েন্টার নেব: একটি শুরুতে (left), আরেকটি শেষে (right)।

# ধাপ ১: left আছে প্রথম 'm'-এ, right আছে শেষ 'm'-এ। দুই পাশের অক্ষর কি মিলছে? হ্যাঁ! (m == m)। এবার left এক ঘর ডানে যাবে, 
# right এক ঘর বামে আসবে।

# ধাপ ২: এখন left আছে 'a'-তে, right-ও আছে 'a'-তে। দুই পাশ কি মিলছে? হ্যাঁ! (a == a)। আবার 
# পয়েন্টার দুটি ভেতরের দিকে সরবে।

# ধাপ ৩: এবার দুটি পয়েন্টারই মাঝখানের 'd' অক্ষরে এসে একে অপরকে ক্রস করবে বা মিলে যাবে। 
# তার মানে পুরো শব্দের কোথাও কোনো অমিল পাওয়া যায়নি। শব্দটা Palindrome!



def is_palidrome(s):
    left = 0
    right =len(s)-1

    while left < right: 
        if s[left] != s[right]:
            return False
        left += 1
        right -= 1
    return True
