# আজকে আমরা শুরু করছি Day 34: Sliding Window Technique (অ্যারের ৩ নম্বর মোস্ট পপুলার এবং ডিমান্ডিং লজিক)।
# ইন্টারভিউতে যখনই তোমাকে কোনো অ্যারে বা স্ট্রিং দিয়ে বলা হবে—"একটি নির্দিষ্ট সাইজের সাব-অ্যারে (Sub-array) বা উইন্ডো (Window) 
# ধরে সর্বোচ্চ/সর্বনিম্ন মান বের করো", তখনই এই টেকনিকটি মাথায় আনবে। 
# এটিও নেস্টেড লুপের $O(N^2)$ কমপ্লেক্সিটিকে এক ঝটকায় $O(N)$-এ নামিয়ে আনে।
# 
# 🎨 ভিজ্যুয়াল মেকানিজম: স্লাইডিং উইন্ডো (Sliding Window) কী?ধরে নাও, তোমার বাসার জানালার কাচটি ডান দিকে 
# স্লাইড বা ড্রাগ করা যায়। জানালার সাইজ কিন্তু ফিক্সড (ধরো ৩ ফুট), কিন্তু জানালাটা ডানে সরালে ভেতরের 
# দৃশ্যটা বদলে যাচ্ছে। কোডিংয়ের ক্ষেত্রেও লজিকটা হুবহু এক!উইন্ডো তৈরি (Create Window): প্রথমে আমরা প্রথম 
# ৩টি উপাদানের যোগফল বের করে নেব।উইন্ডো স্লাইড করা (Slide Window - ম্যাজিক ট্রিক): প্রতিবার নতুন করে 
# ৩টি উপাদান যোগ করার কোনো প্রয়োজন নেই। জানালাটা এক ঘর ডানে সরাতে হলে আমরা শুধু বাম পাশের পুরোনো 
# উপাদানটি বিয়োগ করব আর ডান পাশের নতুন উপাদানটি যোগ করব। এতে প্রতি ধাপে মাত্র ২টি ক্যালকুলেশন করলেই হয়ে যায়!

#
# nums = [2, 1, 5, 1, 3, 2]
# k = 3  #window size


def max_sub_array_of_size_k(nums, k):
    max_sum = 0
    window_sum = 0  # প্রথম উইন্ডোর যোগফল বের করা
    window_start = 0

    for window_end in range(len(nums)):
        window_sum += nums[window_end]
        if window_end >= k - 1:
            max_sum = max(max_sum, window_sum)
            window_sum -= nums[window_start]
            window_start += 1
    return max_sum

max_sum = max_sub_array_of_size_k([2, 1, 5, 1, 3, 2], 3)
print(max_sum)  # 9


